/*  Задача 3: Напишите программу, которая задаёт массив из 8 элементов случайными 
    числами и выводит их на экран. Оформите заполнение массива и вывод в виде 
    функции (пригодится в следующих задачах)
    1,2,5,7,19,1,2,8 -> 1,2,5,7,19,1,2,8 
    6,1,33,5,6,7,7,1 -> 6,1,33,5,6,7,7,1
*/
// Функция которая создает массив
int [] GreatingArray()
{
    // Данная строка выводит собщение которое указано в скобках
    Console.Write("Write the quantities of Array Elemnts ");
    // переводит введенное число из типа данных string в тип данных integer
    int quantitesOfArrayElements = int.Parse(Console.ReadLine());
    // инцилизируем новый массив
    int [] arr = new int [quantitesOfArrayElements];
    int size = arr.Length;
    // цикл для ввода элементов в массив и длина массива будет зависить от заданного аргумента в строках 15, 
    // 13. Согласно этим услоыиям я могу задать сам количество элементов в массиве
    // в этом мне помогают строки 13 и 15.
    for (int i = 0; i < size; i++)
    {
        // строчка создает рандомные элемнеты массива от 1 до 8 включительно
        arr [i] = new Random().Next(1, 9);
        //Выводим на печать элементы массива через запятую
        // можно добавить if и else чтобы поставить точку в конце элементов массива
        Console.Write ($"{arr [i]}, ");
    }
    return arr;
}
int [] test = GreatingArray();
Console.WriteLine();
//строчка выводит 2-й элимент массива для проверки;
Console.WriteLine(test[1]);

