/* Задача 2: Напишите программу, которая принимает на вход три 
   числа и выдает максимальное из этих чисел.
*/
//с помощью строки 5 и 6 задаем параметры ввода колиичества элиментов массиива
Console.Write("Введите количество сравниваемых чисел - ");
int elements = int.Parse(Console.ReadLine());
//инициализируем новый массив который включает в себя то кол-во элиментов которое вводим
int [] digits  = new int [elements];
// определяем что чиисло по индексо 0 в массмве максимум
int max = digits[0];
//Создаем цикл  для ввода чиисел. В {i+1} выводит номер ввода числа начиная с 1 и выполняетдей
//действие сложения в скобках не смотря на то что это строка
for (int i = 0; i < digits.Length; i++)
{
    Console.Write($"Введите число № {i+1} - ");
    digits[i] = int.Parse(Console.ReadLine());
}
// Создаем цикл вывода введенных чисел массива через запятую(смотри оыормдение в {}) в одну строку
Console.Write("Ваши чсла для поиска максимума - ");
for (int i = 0; i < digits.Length; i++)
{
    Console.Write($"{digits[i]}, ");
}
// Создаем цикл для поиска максимального числа среди введных
Console.Write("\nВаш максимум - ");
for (int i = 0; i < digits.Length; i++)
{
    if (digits[i] > max)
    {
        max = digits[i];
    }
}
Console.WriteLine(max);

