/*Задача 4: Напишите программу, которая на вход принимает число (N), 
а на выходе показывает все чётные числа от 1 до N.
*/
Console.Write("Введите чилсо больше 1 - ");
int digit = int.Parse(Console.ReadLine());
int i = 0;

/*  первый if проверяет правилност введеного числа который должен быть больше 1 
    согласно условиям задачи и это условие необоходимо ввести первым для проверки 
    так как если введное число меньше 1 и отрицательное является истиной то нет
    необходиимости выполнять и другие действия
*/
if (digit <= 1)
{
    Console.WriteLine ("В этом диапозоне нет четных чисел согласно условию задачи"); 
}
else if (digit % 2 == 0)
{
    while ( i < digit)
        {
             Console.Write($"{i+2}, ");
             i += 2; 
        }
}
else if (digit % 2 > 0)
{
    digit -=1; 
    while ( i < digit)
        {
            Console.Write($"{i+2}, ");
            i += 2; 
        }
}




